app/views/presentations/index.html.haml

        - if p.private?
          = p.document.sections.size
---
SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "sections"  WHERE "sections"."document_id" = ?  [["document_id", 2]]