app/views/presentations/show.html.haml

SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = ? LIMIT 1  [["id", 2]]
SELECT "sections".* FROM "sections"  WHERE "sections"."document_id" = ?  ORDER BY position  [["document_id", 2]]
SELECT COUNT(*) FROM "sections"  WHERE "sections"."document_id" = ?  [["document_id", 2]]
---
    .slides
      %section(style='display: block;'){class: @background.nil? ? 'none' : @background}
        .present{data: {id: @presentation.id, slide: @slide, count: @tutor ? @presentation.document.sections.size : @presentation.last_open_slide + 1}}