app/controllers/presentations_controller.rb

  def index
    @presentations =
      case params[:type]
      when 'my'
        @old_count = Presentation.old_presentations(@current_user.id).count
        Presentation.where('user_id = ?', @current_user.id).order('updated_at DESC').page(params[:page])
      when 'old'
        Presentation.old_presentations(@current_user.id).order('updated_at DESC').page(params[:page])
---
SELECT COUNT(*) FROM "presentations"  WHERE (user_id = 1 AND updated_at < '2014-12-06 18:46:50.671984')
SELECT  "presentations".* FROM "presentations"  WHERE (user_id = 1 AND updated_at < '2014-12-06 18:46:56.079059')  ORDER BY updated_at DESC LIMIT 25 OFFSET 0
SELECT  "presentations".* FROM "presentations"   ORDER BY updated_at DESC LIMIT 25 OFFSET 0

  def show
    @slide    = params[:slide].to_i
    @section  = @presentation.document.sections[@slide]
    @question = Question.where(:presentation => @presentation, :position => @slide ).first
    unless @question.nil?
       if @question.userHaveRightAnswer @current_user
         @question = nil
       else
         @no_next = true
       end
    end
    respond_to do |format|
      request.format = :html if request.format != :json
      format.json do
        @presentation.update_column(:last_open_slide, params[:value].to_i)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."presentation_id" = 1 AND "questions"."position" = -1  ORDER BY "questions"."id" ASC LIMIT 1
UPDATE "presentations" SET "last_open_slide" = 0 WHERE "presentations"."id" = 2

                @slide > @presentation.last_open_slide
              @section.source = ''
            end
            if @slide >= @presentation.document.sections.count ||
                @presentation.last_open_slide <= @slide
---
SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = ? LIMIT 1  [["id", 2]]
SELECT "sections".* FROM "sections"  WHERE "sections"."document_id" = ?  ORDER BY position  [["document_id", 2]]
SELECT COUNT(*) FROM "sections"  WHERE "sections"."document_id" = ?  [["document_id", 2]]

  def reload
    p = Presentation.find(params['id'])
---
SELECT  "presentations".* FROM "presentations"  WHERE "presentations"."id" = ? LIMIT 1  [["id", 2]]

  def new
    @document = Document.find(params[:document_id])
---
SELECT  "documents".* FROM "documents"  WHERE "documents"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @presentation =
      Presentation.new(document_id: params[:document_id],
                       comment: params[:presentation][:comment],
                       user_id: @current_user.id,
                       groups: params[:presentation][:groups_string].split,
                       last_open_slide: params[:presentation][:last_open_slide],
                       auto_open: params[:presentation][:auto_open] == '1')
    if @presentation.save
      redirect_to presentations_path
    else
      @presentation.groups_string =  params[:presentation][:groups_string]
---
INSERT INTO "presentations" ("auto_open", "comment", "created_at", "document_id", "groups", "last_open_slide", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "groups".* FROM "groups"

  def update
    respond_to do |format|
      format.json do
        @presentation.update_column(:last_open_slide, params[:value].to_i)
        render json: {data: params[:type] == 'hide' ? 'background' : 'none'}
      end
      format.html do
        @presentation.comment = params[:presentation][:comment]
        @presentation.groups = params[:presentation][:groups_string].split
---
UPDATE "presentations" SET "groups" = ?, "last_open_slide" = ?, "updated_at" = ? WHERE "presentations"."id" = 2  [["groups", "---\n- '141131'\n"], ["last_open_slide", 4], ["updated_at", "2014-12-21 18:46:01.846415"]]
SELECT "groups".* FROM "groups"

  def set_presentation
    @presentation = Presentation.find(params[:id])
---
SELECT  "presentations".* FROM "presentations"  WHERE "presentations"."id" = ? LIMIT 1  [["id", 2]]