app/controllers/questions_controller.rb

  def index
    @questions = Question.where(:presentation => @presentation).full.order_position.all
---
SELECT "questions".* FROM "questions"  WHERE "questions"."presentation_id" = 2  ORDER BY "questions"."position" ASC

  def checkAnswer
    questionID = params[:questionID].to_i
    answer     = params[:answer]
    question = Question.find(questionID)
    question.checkAnswer(answer)
    a = Answer.new
    a.text = answer
    a.question = question
    a.user   = @current_user
    a.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "answers" ("created_at", "question_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-29 22:12:14.163273"], ["question_id", 4], ["text", "daq4"], ["updated_at", "2014-12-29 22:12:14.163273"], ["user_id", 1]]

  def create
    @question = Question.new(question_params)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("answer_array", "answer_type", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer_array", "--- ''\n"], ["answer_type", 0], ["created_at", "2014-12-14 18:39:17.551681"], ["name", ""], ["updated_at", "2014-12-14 18:39:17.551681"]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "answer_array" = ?, "answer_type" = ?, "updated_at" = ? WHERE "questions"."id" = 1  [["answer_array", "--- ''\n"], ["answer_type", 0], ["updated_at", "2014-12-14 18:39:25.900159"]]

  def destroy
    @presentation_id = @question.presentation.id
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]